# 处理丢失数据

有两种丢失数据:  
- None
- np.nan(Nan)

In [2]:
import numpy as np

In [3]:
%timeit np.arange(0,10000,dtype=int).sum()

14.6 µs ± 187 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [6]:
%timeit np.arange(0,10000,dtype=float).sum()

16.3 µs ± 356 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [7]:
%timeit np.arange(0,10000,dtype=object).sum()

486 µs ± 4.8 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

## 1.None  
None是python自带的数据类型,其数据类型为python object.  
因此None不能参与到任何计算中去  
object类型的运算要比int类型的运算慢得多

In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

# 2.np.nan(NaN)  
np.nan是浮点类型,能参与到计算中,但计算的结果总是NaN  
但可以使用np.nan*()函数来计算nan,此时nan为

# 3.pandas中的None与NaN
- 1)pandas中None与np.nan

#  2)pandas中None与np.nan的操作
- isnull()
- notnull()

In [2]:
df = DataFrame({'age':[20,3,50,19,22],
                'salary':[10000,222,1215,1252,1215]},
                index=['张三','李四','小赵','王五','但色'],columns=['age','salary','work'])
df

    age  salary work
张三   20   10000  NaN
李四    3     222  NaN
小赵   50    1215  NaN
王五   19    1252  NaN
但色   22    1215  NaN

In [24]:
df.work['李四':'王五'] = 'Python'
df

H:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

    age  salary    work
张三   20   10000     NaN
李四    3     222  Python
小赵   50    1215  Python
王五   19    1252  Python
但色   22    1215     NaN

In [23]:
df

    age  salary    work
张三   20   10000     NaN
李四    3     222  Python
小赵   50    1215  Python
王五   19    1252  Python
但色   22    1215     NaN

In [3]:
# 根据获得的数据去除原来数据的空数据
s1 = df.isnull().any(axis = 1)

In [ ]:
# 有了s1这个数据,获取哪些